{
  "GENERAL": {
    "IDIOMA_INGLES": "Ingles",
    "IDIOMA_ESPANOL": "Español"
  },
  "HEADER": {
    "INICIO": "Inicio",
    "CONTACTO": "Contacto",
    "SOBRE_MI": "Sobre mí",
    "RECOMENDACIONES": "Testimonios",
    "PROYECTOS": "Proyectos"
  },
  "MAIN_VIEW": {
    "TITULO": "hey, Soy Daniel López",
    "DESCRIPCION": "Desarrollador Full stack, con más de 4 años de experiencia en el mundo de la programación."
  },
  "ABOUT_ME": {
    "TITULO": "Sobre mí",
    "DESCRIPCION": "Conoce mis habilidades técnicas y los valores que me caracterizan.",
    "PARAGRAFO_1": "Soy un desarrollador fullStack con sólidos conocimientos en los    lenguajes <span class='paragraph-background'>JavaScript</span> y <span class='paragraph-background'>TypeScript</span>.",
    "PARAGRAFO_2": "He desarrollado plataformas web con tecnologías <span class='paragraph-background'> frontend</span> como <span class='paragraph-strong'> Angular, React, Vue </span> y tecnologías <span class='paragraph-background'> backend</span> como lo son <span class='paragraph-strong'> Node js </span> y <span class='paragraph-strong'> express</span>, integradas con bases de datos <span class='paragraph-strong'> No sql </span> como <span class='paragraph-strong'>mongo db</span> e implementando arquitecturas <span class='paragraph-strong'> AWS</span>.",
    "PARAGRAFO_3": "En mi carrera, he participado en proyectos retadores para empresas de    <span class='paragraph-strong'> diferentes países</span>, lo cual me ha permitido consolidar mis conocimientos técnicos y mejorar en la <span class='paragraph-strong'> solución de problemas reales</span> mediante la tecnología.",
    "PARAGRAFO_4": "Me motivan los nuevos desafíos y pertenecer a grandes equipos que tengan como objetivo desarrollar productos de calidad. <span class='paragraph-strong'> Soy una persona amante del cambio</span>, <span class='paragraph-strong'>confiable</span> y <span class='paragraph-strong'>disciplinada</span>.",
    "CONOCEME": "Conóceme!",
    "HABILIDADES_TECNICAS": "Habilidades técnicas"
  },
  "JOBS": {
    "DESCRIPCION": "Aquí hay algunos proyectos de software en los que he participado",
    "TRABAJO2": {
      "DESCRIPCION": "La empresa Mexicana, Mochileros. Dedicada a la comercialización de tours a nivel mundial. Requería desarrollar una plataforma web en la cual publicar sus servicios, la cual debía contar con <span class='paragraph-strong'> sistemas de geolocalización</span> e  integración con <span class='paragraph-background'> pasarelas de pagos </span>. Además, un panel de control en el cual se gestionara la información publicada en la plataforma web."
    },
    "TRABAJO3": {
      "DESCRIPCION": "Integración de la API sabre. Esta api proporciona toda la información para la comercialización de vuelos (precios, horarios, escalas, etc). Fue integrada con la plataforma web de la empresa Mexicana, Mochileros."
    },
    "TRABAJO4": {
      "TITULO": "Página Personal",
      "DESCRIPCION": "Este proyecto es una página personal desarrollada en Angular, la cual puede ser utilizada por cualquier persona que desee tener un sitio web. es totalmente gratis. <a class='link-github' target='_blank' href='https://github.com/ldani-dev/public-personalPage'>Ver github</a>"
    }
  },
  "RECOMMENDATIONS": {
    "TITULO": "Testimonios",
    "DESCRIPCION": "Las personas con las que he trabajado han dicho algunas cosas bonitas...",
    "TESTIMONIO1": {
      "DESCRIPCION": "Conozco a Daniel hace más de cinco años, fui su profesor de programación y puedo dar fe de sus habilidades técnicas, sus excelentes habilidades en términos de trabajo en equipo, comunicación, solución de problemas y liderazgo, y su disciplina y dedicación al trabajo. Además, he tenido la oportunidad de compartir con Daniel y sé que es una persona confiable. Entonces considero que él puede ser una excelente incorporación para cualquier equipo de trabajo.",
      "PROFESION": "Ingeniero de Software"
    },
    "TESTIMONIO2": {
      "DESCRIPCION": "Daniel es un excelente desarrollador proactivo ante todo y siempre en busca de las mejores prácticas, hemos participado y aún seguimos en desarrollo conjunto de plataformas que cuentan con un excelente rendimiento en tecnologías modernas.",
      "PROFESION": "Desarrollador de Software, creador de contenido"
    }
  },
  "FOOTER": {
    "SOCIAL": "SOCIAL",
    "DESCRIPCION": "Un desarrollador de software, con el único propósito de servir a la comunidad y aprender constantemente.",
    "CREADO_POR": "Creado por ",
    "CREADO_CON": "Hecho con"
  },
  "CONTACT": {
    "DESCRIPCION": "Siempre estoy dispuesto a enfrentarme a nuevos desafíos. Cuéntame el tuyo."
  },
  "FORM_CONTACT": {
    "NOMBRE": "Nombre",
    "EMAIL": "Email",
    "MENSAJE": "Mensaje",
    "ENVIAR": "Enviar",
    "ENVIANDO": "Enviando"
  },
  "VALIDATIONS": {
    "NOMBRE_REQUERIDO": "Nombre es requerido",
    "EMAIL_REQUERIDO": "Email es requerido",
    "EMAIL_INVALIDO": "Email no es válido 'example@example.com'",
    "MENSAJE_REQUERIDO": "El mensaje es requerido",
    "MENSAJE_LONGITUD_MINIMA": "El mensaje debe contener mínimo 30 caracteres",
    "MENSAJE_LONGITUD_MAXIMA": "El mensaje debe contener máximo 500 caracteres"
  },
  "SUCCESS": {
    "TITULO": "!Genial! Juntos vamos a crear grandes cosas",
    "DESCRIPCION": "Tu mensaje ha sido enviado, en breve me pondré en contacto",
    "CONTINUAR": "Continuar"
  },
  "NOT_FOUND": {
    "TITULO": "Parece que estás perdido. ¿Quizás probar con una página diferente?",
    "RETORNAR": "Volver al Inicio"
  }
}
