{
  "GENERAL": {
    "IDIOMA_INGLES": "Ingles",
    "IDIOMA_ESPANOL": "Español"
  },
  "HEADER": {
    "INICIO": "Inicio",
    "CONTACTO": "Contacto",
    "SOBRE_MI": "Sobre mí",
    "RECOMENDACIONES": "Testimonios",
    "PROYECTOS": "Proyectos"
  },
  "MAIN_VIEW": {
    "TITULO": "hey, Soy Daniel López",
    "DESCRIPCION": "Desarrollador Full stack, con más de 4 años de experiencia en el mundo de la programación."
  },
  "ABOUT_ME": {
    "TITULO": "Sobre mí",
    "DESCRIPCION": "Conoce mis habilidades técnicas y los valores que me caracterizan.",
    "PARAGRAFO_1": "Disfruto profundizar en los problemas de los clientes y solucionarlos utilizando tecnologías modernas. He creado plataformas web para <span class='paragraph-strong'>  diferentes empresas alrededor del mundo</span>, teniendo siempre como enfoque desarrollar productos de <span class='paragraph-background'>Calidad</span> y altamente escalables.",
    "PARAGRAFO_2": "Tener curiosidad constante es una habilidad que he desarrollado con el paso de los años y esto me ha permitido aprender a profundidad sobre las tecnologías en las que trabajo. Siempre tengo buena disposición para desarrollar nuevas habilidades y   <span class='paragraph-strong'> afrontar desafíos </span> que se presentan en el camino hacia mis metas.",
    "PARAGRAFO_3": "Conocer nuevas personas y escuchar nuevas perspectivas es algo que realmente disfruto hacer. Déjame un mensaje si quieres hablar sobre desarrollo de software, nuevas tecnologías o <span class='paragraph-strong'>  ir por un café.</span> ",
    "CONOCEME": "Conóceme!",
    "HABILIDADES_TECNICAS": "Habilidades técnicas"
  },
  "JOBS": {
    "DESCRIPCION": "Aquí hay algunos proyectos de software en los que he participado",
    "TRABAJO1": {
      "TITULO": "Clon Idealista",
      "DESCRIPCION": "Replica completamente funcional de la principal Empresa del sector inmobiliario en Europa.   <a class='link-github' target='_blank' href='https://github.com/daniellopezj/clone-idealista'>Ver github</a>"
    },
    "TRABAJO2": {
      "DESCRIPCION": "La empresa Mexicana, Mochileros. Dedicada a la comercialización de tours a nivel mundial. Requería desarrollar una plataforma web en la cual publicar sus servicios, la cual debía contar con <span class='paragraph-strong'> sistemas de geolocalización</span> e  integración con <span class='paragraph-background'> pasarelas de pagos </span>. Además, un panel de control en el cual se gestionara la información publicada en la plataforma web."
    },
    "TRABAJO3": {
      "DESCRIPCION": "Integración de la API sabre. Esta api proporciona toda la información para la comercialización de vuelos (precios, horarios, escalas, etc) utilizando <span class='paragraph-background'> pasarelas de pagos con Stripe </span. Fue integrada con la plataforma web de la empresa Mexicana, Mochileros."
    },
    "TRABAJO4": {
      "TITULO": "Portafolio Publico",
      "DESCRIPCION": "Proyecto Open source desarrollado con angular 14 el cual le proporciona a desarrolladores una plantilla para crear su portafolio web. Es totalmente gratis!!. <a class='link-github' target='_blank' href='https://github.com/daniellopezj/public-personalPage'>Ver github</a>"
    }
  },
  "RECOMMENDATIONS": {
    "TITULO": "Testimonios",
    "DESCRIPCION": "Las personas con las que he trabajado han dicho algunas cosas bonitas...",
    "TESTIMONIO1": {
      "DESCRIPCION": "Conozco a Daniel hace más de cinco años, fui su profesor de programación y puedo dar fe de sus habilidades técnicas, sus excelentes habilidades en términos de trabajo en equipo, comunicación, solución de problemas y liderazgo, y su disciplina y dedicación al trabajo. Además, he tenido la oportunidad de compartir con Daniel y sé que es una persona confiable. Entonces considero que él puede ser una excelente incorporación para cualquier equipo de trabajo.",
      "PROFESION": "Ingeniero de Software"
    },
    "TESTIMONIO2": {
      "DESCRIPCION": "Daniel es un excelente desarrollador proactivo ante todo y siempre en busca de las mejores prácticas, hemos participado y aún seguimos en desarrollo conjunto de plataformas que cuentan con un excelente rendimiento en tecnologías modernas.",
      "PROFESION": "Desarrollador de Software, creador de contenido"
    }
  },
  "FOOTER": {
    "SOCIAL": "SOCIAL",
    "DESCRIPCION": "Un desarrollador de software, con el único propósito de servir a la comunidad y aprender constantemente.",
    "CREADO_POR": "Creado por ",
    "CREADO_CON": "Hecho con"
  },
  "CONTACT": {
    "DESCRIPCION": "Siempre estoy dispuesto a enfrentarme a nuevos desafíos. Cuéntame el tuyo."
  },
  "FORM_CONTACT": {
    "NOMBRE": "Nombre",
    "EMAIL": "Email",
    "MENSAJE": "Mensaje",
    "ENVIAR": "Enviar",
    "ENVIANDO": "Enviando"
  },
  "VALIDATIONS": {
    "NOMBRE_REQUERIDO": "Nombre es requerido",
    "EMAIL_REQUERIDO": "Email es requerido",
    "EMAIL_INVALIDO": "Email no es válido 'example@example.com'",
    "MENSAJE_REQUERIDO": "El mensaje es requerido",
    "MENSAJE_LONGITUD_MINIMA": "El mensaje debe contener mínimo 30 caracteres",
    "MENSAJE_LONGITUD_MAXIMA": "El mensaje debe contener máximo 500 caracteres"
  },
  "SUCCESS": {
    "TITULO": "!Genial! Juntos vamos a crear grandes cosas",
    "DESCRIPCION": "Tu mensaje ha sido enviado, en breve me pondré en contacto",
    "CONTINUAR": "Continuar"
  },
  "NOT_FOUND": {
    "TITULO": "Parece que estás perdido. ¿Quizás probar con una página diferente?",
    "RETORNAR": "Volver al Inicio"
  }
}
